In [ ]:
import numpy as np

In [ ]:
a = np.array([[1,2,3,4],
              [5,6,7,8],
              [9,10,11,12]])

In [ ]:
a.shape

In [ ]:
np.shape(a)

In [ ]:
x=np.zeros((3,4))
print(x)

In [15]:
x=np.ones((3,4))
print(x)

[[1. 1. 1. 1.]
 [1. 1. 1. 1.]
 [1. 1. 1. 1.]]

In [19]:
print(a[1])

[5 6 7 8]

In [25]:
x=[[1,1,1,1],
  [1,1,1,1],
  [1,1,1,1]]

In [28]:
y=np.empty_like(x)
print(y)

[[0 0 0 0]
 [0 0 0 0]
 [0 0 0 0]]

In [36]:
x=np.array(range(0,11,2))
print(x)

[ 0  2  4  6  8 10]

In [34]:
x=np.full((2,4),'y')
print(x)

[['y' 'y' 'y' 'y']
 ['y' 'y' 'y' 'y']]

In [39]:
a = np.array([[1,2,3,4],
              [5,6,7,8],
              [9,10,11,12]])
b=a[:2 , 1:3] #슬라이싱
print(b)

[[2 3]
 [6 7]]

In [40]:
b[1,1]=70
print(b)
print(a)#슬라이싱 특징

[[ 2  3]
 [ 6 70]]
[[ 1  2  3  4]
 [ 5  6 70  8]
 [ 9 10 11 12]]

In [42]:
c=np.array([0,1,2,3,4,5,6,7,8,9])
print(c[0:8:2])
print(c[-2:10])
print(c[-3:3:-1])
print(c[::-1])

[0 2 4 6]
[8 9]
[7 6 5 4]
[9 8 7 6 5 4 3 2 1 0]

In [44]:
c=a[1, :]
d=a[1:2, :]
print(c,c.shape)
print(d,d.shape)

[ 5  6 70  8] (4,)
[[ 5  6 70  8]] (1, 4)

# 정수 인덱싱

In [53]:
a=np.array([[1,2,3,4],
          [5,6,7,8],
          [9,10,11,12]])

In [55]:
row=[[0,0],
    [2,2]]
columns=[[0,3],
        [0,3]]
#(0,0) (0,3)
#(2,0) (2,3)
print(a[row,columns])

[[ 1  4]
 [ 9 12]]

In [56]:
b=np.array([0,2,1])
b

array([0, 2, 1])

In [57]:
print(a[np.arange(3),b])
print(a[[0,1,2],b])
#arange(3) = range(3)

[ 1  7 10]
[ 1  7 10]

In [59]:
c=a[[0,1,2],b]$인덱싱
c[1]=70
print(c)
print(a)#인덱싱은 원래 배열은 건드리지 않음

[ 1 70 10]
[[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]

In [63]:
bool_idx=(a>3)
print(a)
print(bool_idx)
print(a[bool_idx])
print(a[a>3])

[[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]
[[False False False  True]
 [ True  True  True  True]
 [ True  True  True  True]]
[ 4  5  6  7  8  9 10 11 12]
[ 4  5  6  7  8  9 10 11 12]

In [ ]:
print(a.all())

In [68]:
print(a.any())

True

In [85]:
len(a)

3

In [84]:
len(a[0])

4

In [86]:
for i in str(a):
    if int(i)>3:
        print(i)
#stackoverflow 찾아보기

ValueError: invalid literal for int() with base 10: '['

In [94]:

for i in a:
    print(i)#i는 행 별로 리스트로 
    for j in i: 
        if (j>3):
            print(j)

[1 2 3 4]
4
[5 6 7 8]
5
6
7
8
[ 9 10 11 12]
9
10
11
12

for i in a: #a가 3차원이라면 i는 2차원배열
    for j in i:# j는 1차원 배열
        for k in j:
            print(k)

In [73]:
print(a[a>3])

[ 4  5  6  7  8  9 10 11 12]

In [95]:
x= np.array([[1,2],[3,4]],)

# numpy 행렬곱

print(x.dot(y))
print(np.dot(x,y))
print(x@y)

In [99]:
x=np.array([[1,2],
           [3,4]])
print(np.sum(x))

10

In [101]:
print(np.sum(x,axis=0))#세로

[4 6]

In [103]:
print(np.sum(x,axis=1))#가로

[3 7]

In [105]:
x=np.array([[1,2,3],
          [4,5,6]])
print(x,x.shape)
print()
y=x.T
print(y,y.shape)

[[1 2 3]
 [4 5 6]] (2, 3)

[[1 4]
 [2 5]
 [3 6]] (3, 2)

# 브로드 캐스팅

In [107]:
x=np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
y=np.array([1,0,1])

y = x+y

print(y)

[[ 2  2  4]
 [ 5  5  7]
 [ 8  8 10]
 [11 11 13]]

# 원 핫 인코딩

In [111]:
x=np.array([0,4,3,2,4,0,2,2,1]) #경우의 수 5개 , 단위행렬의 인덱스들
i=np.eye(5)
print(i)

ix=i[x]
ix

[[1. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0.]
 [0. 0. 1. 0. 0.]
 [0. 0. 0. 1. 0.]
 [0. 0. 0. 0. 1.]]

array([[1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1.],
       [0., 0., 0., 1., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.]])

In [117]:
x = np.arange(10)
print(x)
print(x.shape)
inputSize=5;


print(x.reshape(-1,inputSize)) #-1은 미정
print(x.reshape(5,2))

[0 1 2 3 4 5 6 7 8 9]
(10,)
[[0 1 2 3 4]
 [5 6 7 8 9]]
[[0 1]
 [2 3]
 [4 5]
 [6 7]
 [8 9]]

# 스플릿 찾아보기

# pandas

In [118]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [ ]:
ser = Series([4,7,-5,3]) #통일된 데이터 타입만 가질 수 있다.

In [122]:
ser.values

array([ 4,  7, -5,  3], dtype=int64)

In [123]:
ser

0    4
1    7
2   -5
3    3
dtype: int64

In [124]:
ser.index

RangeIndex(start=0, stop=4, step=1)

In [126]:
index_list=['a','b','c','d']
ser.index=index_list
ser

a    4
b    7
c   -5
d    3
dtype: int64

In [128]:
ser.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [130]:
ser[ser>3]

a    4
b    7
dtype: int64

In [133]:
pd.isnull(ser)

a    False
b    False
c    False
d    False
dtype: bool

In [134]:
pd.notnull(ser)

a    True
b    True
c    True
d    True
dtype: bool

# dataFrame

In [137]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002],
      'pop':[1.5,1.7,3.6,2.4,2.9]}
df=DataFrame(data)
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [138]:
df=DataFrame(data,columns=['year','state','pop'])
df

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [157]:
df2 = DataFrame(data, columns=['year','state','pop','debt'],
                              index=['one','two','three','four','five'])
df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [158]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [159]:
df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [148]:
df['year']

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [160]:
somelist=['year','pop']
df2[somelist]

       year  pop
one    2000  1.5
two    2001  1.7
three  2002  3.6
four   2001  2.4
five   2002  2.9

In [161]:
df2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [164]:
df2.iloc[:2]

     year state  pop debt
one  2000  Ohio  1.5  NaN
two  2001  Ohio  1.7  NaN

In [167]:
somelist=['one','two']
print(df2.index.isin(['one','two']))#isin은 여러 값일떄 아니면 ==
df2.loc[df2.index.isin(['one','two'])]

[ True  True False False False]

     year state  pop debt
one  2000  Ohio  1.5  NaN
two  2001  Ohio  1.7  NaN

In [169]:
lookingfor=[2000,2001]
somelist=df2['year'].isin([2000,2001])
df2[somelist]

      year   state  pop debt
one   2000    Ohio  1.5  NaN
two   2001    Ohio  1.7  NaN
four  2001  Nevada  2.4  NaN

In [170]:
df2.debt=np.arange(5)
df2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [172]:
df2['estern']=df2.state=='Ohio'
df2

       year   state  pop  debt  estern
one    2000    Ohio  1.5     0    True
two    2001    Ohio  1.7     1    True
three  2002    Ohio  3.6     2    True
four   2001  Nevada  2.4     3   False
five   2002  Nevada  2.9     4   False

In [173]:
del df2['estern']
df2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [175]:
df2.T

        one   two three    four    five
year   2000  2001  2002    2001    2002
state  Ohio  Ohio  Ohio  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9
debt      0     1     2       3       4

In [177]:
df2.values

array([[2000, 'Ohio', 1.5, 0],
       [2001, 'Ohio', 1.7, 1],
       [2002, 'Ohio', 3.6, 2],
       [2001, 'Nevada', 2.4, 3],
       [2002, 'Nevada', 2.9, 4]], dtype=object)

In [178]:
df2.T

        one   two three    four    five
year   2000  2001  2002    2001    2002
state  Ohio  Ohio  Ohio  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9
debt      0     1     2       3       4

In [179]:
df2.values

array([[2000, 'Ohio', 1.5, 0],
       [2001, 'Ohio', 1.7, 1],
       [2002, 'Ohio', 3.6, 2],
       [2001, 'Nevada', 2.4, 3],
       [2002, 'Nevada', 2.9, 4]], dtype=object)